![Python Logo](./img/python-logo-master-v3-TM-flattened_small.png)

# Financial Programming - IÃ‰SEG, Lille - MBD 2019-2020
## Group Project - Financial Data

In [1]:
first_name = 'kurt'
last_name = 'kusterer'

### Data Exploration

In [2]:
# Import libraries
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [3]:
from pandasql import sqldf 
pysqldf = lambda q: sqldf(q, globals())

**Input data**

In [4]:
# Import banking data
# Note: This data was extracted on 1999

# Each record describes characteristics of a client
client = pd.read_csv('C:/Users/kkusterer/Documents/data_berka/client.asc', sep=';')

# Each record describes static characteristics of an account
account = pd.read_csv('C:/Users/kkusterer/Documents/data_berka/account.asc', sep=';')

# Each record describes a credit card issued to an account
card = pd.read_csv('C:/Users/kkusterer/Documents/data_berka/card.asc', sep=';')

# Each record describes demographic characteristics of a district
district = pd.read_csv('C:/Users/kkusterer/Documents/data_berka/district.asc', sep=';')

# Each record relates together a client with an account
# i.e. this relation describes the rights of clients to operate accounts
disp = pd.read_csv('C:/Users/kkusterer/Documents/data_berka/disp.asc', sep=';')

# Each record describes characteristics of a payment order (debits only)
order = pd.read_csv('C:/Users/kkusterer/Documents/data_berka/order.asc', sep=';')

# Each record describes one transaction on an account
trans = pd.read_csv('C:/Users/kkusterer/Documents/data_berka/trans.asc', sep=';', low_memory=False)

# Each record describes a loan granted for a given account
loan = pd.read_csv('C:/Users/kkusterer/Documents/data_berka/loan.asc', sep=';')

## Adding information to each record, replacing obscure values.

#### Client record

In [5]:
#Adding birthyear and Age to the client data base
client['birth_year'] = client['birth_number'].transform(lambda bn: int('19' + str(bn)[:2]))
client['age'] = 1999 - client['birth_year']

In [6]:
#Extracting gender from client[birth_number] and reformating it
# Function to extract birth month and gender
def to_month_gender(birth_number):
    
    # Extract the birth month and birth day from the birth_number column
    mon = str(birth_number)
    birth_month = int(mon[2:4])
    day = str(birth_number)
    birth_day = int(day[4:])
    
    # Extract the gender from the birth month
    if birth_month > 50:
        gender = "F"
        birth_month = birth_month - 50
    else:
        gender = 'M'
        
    return pd.Series({'birth_month':birth_month, 'birth_day':birth_day, 'gender':gender})

# Apply the function to client table
client[['birth_month', 'birth_day', 'gender']] = client['birth_number'].apply(to_month_gender)

In [7]:
client.head()

,client_id,birth_number,district_id,birth_year,age,birth_month,birth_day,gender
0,1,706213,18,1970,29,12,13,F
1,2,450204,1,1945,54,2,4,M
2,3,406009,1,1940,59,10,9,F
3,4,561201,5,1956,43,12,1,M
4,5,605703,5,1960,39,7,3,F

#### Account record

In [8]:
account.head()

   account_id  district_id         frequency    date
0         576           55  POPLATEK MESICNE  930101
1        3818           74  POPLATEK MESICNE  930101
2         704           55  POPLATEK MESICNE  930101
3        2378           16  POPLATEK MESICNE  930101
4        2632           24  POPLATEK MESICNE  930102

In [9]:
def replfreq (freqcode):
    if "MESICNE" in freqcode:
        freq = "MONTHLY"
    elif "TYDNE" in freqcode:
        freq = "WEEKLY"
    elif "OBRATU" in freqcode:
        freq = "AFTER TRANSACTION"
    
    return freq

def repldate (datecode): #replace the YYMMDD column with 3 columns for Year (YYYY) Month and Day
    Year = "19" + str(datecode)[:2]
    Month = str(datecode)[2:4]
    Day = str(datecode)[4:6]
    
    return pd.Series({'Year':Year,'Month':Month,'Day':Day})

In [10]:
account['freq'] = account["frequency"].apply(replfreq)

In [11]:
account[['Year','Month','Day']] = account["date"].apply(repldate)

In [12]:
account.head()

   account_id  district_id         frequency    date     freq  Year Month Day
0         576           55  POPLATEK MESICNE  930101  MONTHLY  1993    01  01
1        3818           74  POPLATEK MESICNE  930101  MONTHLY  1993    01  01
2         704           55  POPLATEK MESICNE  930101  MONTHLY  1993    01  01
3        2378           16  POPLATEK MESICNE  930101  MONTHLY  1993    01  01
4        2632           24  POPLATEK MESICNE  930102  MONTHLY  1993    01  02

#### Order record

In [13]:
order.head()

   order_id  account_id bank_to  account_to  amount k_symbol
0     29401           1      YZ    87144583  2452.0     SIPO
1     29402           2      ST    89597016  3372.7     UVER
2     29403           2      QR    13943797  7266.0     SIPO
3     29404           3      WX    83084338  1135.0     SIPO
4     29405           3      CD    24485939   327.0

In [14]:
def krepl (k): #replace the k_symbol by a more comprehensive string (used in multiple records)
    k = str(k)
    if 'POJISTNE' in k:
        payment = "INSURRANCE"
    elif 'SIPO' in k:
        payment = "HOUSEHOLD"
    elif 'UVER' in k:
        payment = "LOAN"
    elif 'LEASING' in k:
        payment = "LEASING"
    elif 'SLUZBY' in k:
        payment = "STATEMENT"
    elif "UROK" in k:
        payment = "INTEREST CREDITED"
    elif 'SANKC. UROK' in k:
        payment = "SANCTION INTEREST (NEGATIVE BALANCE)"
    elif 'DUCHOD' in k :
        payment = "OLD AGE PENSION"
    else:
        payment = "UNKNOWN"
    
    return payment

In [15]:
order["Payment characterization"] = order["k_symbol"].apply(krepl)

In [16]:
order.head()

,order_id,account_id,bank_to,account_to,amount,k_symbol,Payment characterization
0,29401,1,YZ,87144583,2452.0,SIPO,HOUSEHOLD
1,29402,2,ST,89597016,3372.7,UVER,LOAN
2,29403,2,QR,13943797,7266.0,SIPO,HOUSEHOLD
3,29404,3,WX,83084338,1135.0,SIPO,HOUSEHOLD
4,29405,3,CD,24485939,327.0,,UNKNOWN

#### Transaction record

In [17]:
print(trans.shape)
trans.head()

(1056320, 10)

,trans_id,account_id,date,type,operation,amount,balance,k_symbol,bank,account
0,695247,2378,930101,PRIJEM,VKLAD,700.0,700.0,NaN,NaN,NaN
1,171812,576,930101,PRIJEM,VKLAD,900.0,900.0,NaN,NaN,NaN
2,207264,704,930101,PRIJEM,VKLAD,1000.0,1000.0,NaN,NaN,NaN
3,1117247,3818,930101,PRIJEM,VKLAD,600.0,600.0,NaN,NaN,NaN
4,579373,1972,930102,PRIJEM,VKLAD,400.0,400.0,NaN,NaN,NaN

##### This record is more than a million row long. Any operation on this record will take some time, please process it carrefully.

In [18]:
trans[['Year','Month','Day']] = trans["date"].apply(repldate)

In [19]:
def typerepl(Type):
    if "PRIJEM" in Type:
        transaction = "+"
    else:
        transaction = "-"
    return transaction

def operepl(ope):
    ope = str(ope)
    if "VYBER KARTOU" in ope:
        mode = "Withdrawal in C.C."
    elif "VKLAD" in ope:
        mode = "Credit in cash"
    elif "PREVOD Z UCTU" in ope:
        mode = "Withdrawal from another bank"
    elif "VYBER" in ope:
        mode = "Withdrawal in cash"
    elif "PREVOD NA UCET" in ope:
        mode = "Credit to another bank"
    else:
        mode = "UNKNOWN"
    return mode

In [20]:
trans["Payment Characterization"] = trans["k_symbol"].apply(krepl)
trans["Transaction Type"] = trans["type"].apply(typerepl)
trans["Transaction Mode"] = trans["operation"].apply(operepl)

In [21]:
trans.head(20)

,trans_id,account_id,date,type,operation,amount,balance,k_symbol,bank,account,Year,Month,Day,Payment Characterization,Transaction Type,Transaction Mode
0,695247,2378,930101,PRIJEM,VKLAD,700.0,700.0,NaN,NaN,NaN,1993,01,01,UNKNOWN,+,Credit in cash
1,171812,576,930101,PRIJEM,VKLAD,900.0,900.0,NaN,NaN,NaN,1993,01,01,UNKNOWN,+,Credit in cash
2,207264,704,930101,PRIJEM,VKLAD,1000.0,1000.0,NaN,NaN,NaN,1993,01,01,UNKNOWN,+,Credit in cash
3,1117247,3818,930101,PRIJEM,VKLAD,600.0,600.0,NaN,NaN,NaN,1993,01,01,UNKNOWN,+,Credit in cash
4,579373,1972,930102,PRIJEM,VKLAD,400.0,400.0,NaN,NaN,NaN,1993,01,02,UNKNOWN,+,Credit in cash
5,771035,2632,930102,PRIJEM,VKLAD,1100.0,1100.0,NaN,NaN,NaN,1993,01,02,UNKNOWN,+,Credit in cash
6,452728,1539,930103,PRIJEM,VKLAD,600.0,600.0,NaN,NaN,NaN,1993,01,03,UNKNOWN,+,Credit in cash
7,725751,2484,930103,PRIJEM,VKLAD,1100.0,1100.0,NaN,NaN,NaN,1993,01,03,UNKNOWN,+,Credit in cash
8,497211,1695,930103,PRIJEM,VKLAD,200.0,200.0,NaN,NaN,NaN,1993,01,03,UNKNOWN,+,Credit in cash
9,232960,793,930103,PRIJEM,VKLAD,800.0,800.0,NaN,NaN,NaN,1993,01,03,UNKNOWN,+,Credit in cash
10,505240,1726,930103,PRIJEM,VKLAD,1000.0,1000.0,NaN,NaN,NaN,1993,01,03,UNKNOWN,+,Credit in cash
11,144541,485,930104,PRIJEM,VKLAD,300.0,300.0,NaN,NaN,NaN,1993,01,04,UNKNOWN,+,Credit in cash
12,637741,2177,930104,PRIJEM,VKLAD,800.0,800.0,NaN,NaN,NaN,1993,01,04,UNKNOWN,+,Credit in cash
13,689827,2357,930104,PRIJEM,VKLAD,800.0,800.0,NaN,NaN,NaN,1993,01,04,UNKNOWN,+,Credit in cash
14,846006,2881,930104,PRIJEM,VKLAD,700.0,700.0,NaN,NaN,NaN,1993,01,04,UNKNOWN,+,Credit in cash
15,637742,2177,930105,PRIJEM,PREVOD Z UCTU,5123.0,5923.0,DUCHOD,YZ,62457513.0,1993,01,05,OLD AGE PENSION,+,Withdrawal from another bank
16,2908688,9635,930105,PRIJEM,VKLAD,400.0,400.0,NaN,NaN,NaN,1993,01,05,UNKNOWN,+,Credit in cash
17,232961,793,930105,PRIJEM,PREVOD Z UCTU,3401.0,4201.0,NaN,IJ,6149286.0,1993,01,05,UNKNOWN,+,Withdrawal from another bank
18,192096,652,930105,PRIJEM,VKLAD,700.0,700.0,NaN,NaN,NaN,1993,01,05,UNKNOWN,+,Credit in cash
19,542215,1844,930106,PRIJEM,VKLAD,500.0,500.0,NaN,NaN,NaN,1993,01,06,UNKNOWN,+,Credit in cash

In [22]:
trans.operation.isnull().sum()

183114

#### Loan record

In [23]:
loan.head()

   loan_id  account_id    date  amount  duration  payments status
0     5314        1787  930705   96396        12    8033.0      B
1     5316        1801  930711  165960        36    4610.0      A
2     6863        9188  930728  127080        60    2118.0      A
3     5325        1843  930803  105804        36    2939.0      A
4     7240       11013  930906  274740        60    4579.0      A

In [24]:
loan[['Year','Month','Day']] = loan['date'].apply(repldate)

In [25]:
loan.head()

,loan_id,account_id,date,amount,duration,payments,status,Year,Month,Day
0,5314,1787,930705,96396,12,8033.0,B,1993,07,05
1,5316,1801,930711,165960,36,4610.0,A,1993,07,11
2,6863,9188,930728,127080,60,2118.0,A,1993,07,28
3,5325,1843,930803,105804,36,2939.0,A,1993,08,03
4,7240,11013,930906,274740,60,4579.0,A,1993,09,06

#### Card record

In [26]:
card.head()

   card_id  disp_id     type           issued
0     1005     9285  classic  931107 00:00:00
1      104      588  classic  940119 00:00:00
2      747     4915  classic  940205 00:00:00
3       70      439  classic  940208 00:00:00
4      577     3687  classic  940215 00:00:00

In [27]:
card[["Year","Month","Day"]] = card["issued"].apply(repldate)

In [28]:
card.head()

   card_id  disp_id     type           issued  Year Month Day
0     1005     9285  classic  931107 00:00:00  1993    11  07
1      104      588  classic  940119 00:00:00  1994    01  19
2      747     4915  classic  940205 00:00:00  1994    02  05
3       70      439  classic  940208 00:00:00  1994    02  08
4      577     3687  classic  940215 00:00:00  1994    02  15

#### District record

In [29]:
district.head()

,A1,A2,A3,A4,A5,A6,A7,A8,A9,A10,A11,A12,A13,A14,A15,A16
0,1,Hl.m. Praha,Prague,1204953,0,0,0,1,1,100.0,12541,0.29,0.43,167,85677,99107
1,2,Benesov,central Bohemia,88884,80,26,6,2,5,46.7,8507,1.67,1.85,132,2159,2674
2,3,Beroun,central Bohemia,75232,55,26,4,1,5,41.7,8980,1.95,2.21,111,2824,2813
3,4,Kladno,central Bohemia,149893,63,29,6,2,6,67.4,9753,4.64,5.05,109,5244,5892
4,5,Kolin,central Bohemia,95616,65,30,4,1,6,51.4,9307,3.85,4.43,118,2616,3040

In [30]:
district.columns = ['district_code', 'district_name', 'region', 'Number_inhabitants', 'A5', 'A6', 'A7', 'A8', 'A9', '%_urbans', 'Avrg_Salary',
       'A12', 'A13', 'A14', 'A15', 'A16']

### Interactive Tool

#### Those functions will be called at the end of the code

TextInformation definition :

In [31]:
def loansituation(n):
    global paid,nbrpayment,lefttopay #
    
    #Subsetting the main table to have only transaction linked to loans
    IDinfoLoan = IDinfo[IDinfo["Payment Characterization"]=="LOAN"]
    
    #initiating in this order : number of transaction linked to loans, amount paid on the specific loan, nbr of payment,
    #amount left to pay for this specific loan
    testlen = len(IDinfoLoan)
    paid =0
    nbrpayment=0
    lefttopay = loantest.amount.iloc[n]
    
    for i in range(testlen):
        if loantest.payments.iloc[0]==round(IDinfoLoan["amount"].iloc[i]): #if this is true, it is a payment corresponding
            paid += round(IDinfoLoan["amount"].iloc[i])                    #to the specific loan we're looking at
            nbrpayment += 1
            lefttopay -= round(IDinfoLoan["amount"].iloc[i])
        else:
            None
    


def TextInformation():
    global clientest, disptest, IDinfo, ID, districtest, transtest, loantest, cardtest #mainly for testing and debugging purpose
    
    #Prompting the user to enter an ID
    ID = int(input("Which client ID would you like to investigate ? \n Please type the ID here : "))
    clientest = client[client["client_id"]==ID]    
    disptest = disp[disp["client_id"]==ID]
    
    #Merging client and disp to get the account_id with client info
    IDinfo = pd.merge(clientest[["client_id","district_id","age","birth_month","gender"]],
                      disptest,
                      how="inner",
                      left_on="client_id",
                      right_on="client_id"
                     )
    
    #ordering the columns in a more comprehensive way
    IDinfo = IDinfo[["client_id","account_id","type","disp_id","age","birth_month","gender","district_id"]]
    
    #taking the district table based on client ID required
    districtest = district[district["district_code"]==IDinfo.district_id[0]] 
    
    #Adding district name and average Salary of this district to our main table
    IDinfo = pd.merge(IDinfo,    
                      districtest [["district_code","district_name","Avrg_Salary"]],
                      how="inner",
                      left_on="district_id",
                      right_on="district_code"
                     ) 
     
    #Taking transaction record of the client
    transtest = trans[trans["account_id"]==IDinfo["account_id"].iloc[0]]
    
    #Taking information about the potential credit card of the customer
    cardtest = card[card["disp_id"]==IDinfo["disp_id"].iloc[0]]
    
    #Adding those informations to our main table
    IDinfo = pd.merge(IDinfo,
                      transtest [["account_id","amount","balance","Year","Month","Day","Payment Characterization","Transaction Mode"]],
                      how="inner",
                      left_on="account_id",
                      right_on="account_id"
                     ) 
    
    #Taking information about the account of the client
    accountest = account[account["account_id"]==IDinfo["account_id"].iloc[0]]
    
    #last will be used to take the last row of the main table, to identify the last transaction registered
    last = len(IDinfo)-1
    
    #Loading the loan informations of the client
    loantest = loan[loan["account_id"]==IDinfo["account_id"].iloc[0]]
    
    #lenght of this table gives the number of loans taken
    nbofloan = len(loantest)
    
    
    ###PRINTING###
    
    #printing general information about the client
    print("-"*20)
    print("\nClient is a " + IDinfo.gender[0] + ", " + str(IDinfo.age[0]) + " years old and lives in " + 
          str(IDinfo.district_name[0]) + ".")
    print("\nHas been a client since " + accountest.Day.iloc[0]+"/"+
        str(accountest.Month.iloc[0])+"/"+str(accountest.Year.iloc[0]))
    if len(cardtest) == 0:
        print("\nThis client has no credit card in our bank.")
    else:
        for n in range(len(cardtest)):
            print("and was issued a " + str(cardtest.type.iloc[n]) + " credit card in " +
                  str(accountest.Day.iloc[n]) + "/" + str(accountest.Month.iloc[n]) + "/" + str(accountest.Year.iloc[n]) + ".")
    
    print("\nLast transaction registered occured the  " +
          str(IDinfo.Day[last])+"/"+str(IDinfo.Month[last])+"/"+str(IDinfo.Year[last]) + 
          ". \nBank account balance : " + str(IDinfo.balance[last])+".")
    
    #printing information about the last non-automatic transaction (no interest credit) to better identify
    #if the client is a sleeping account or not
    while IDinfo["Payment Characterization"][last]=="INTEREST CREDITED":
        last -=1
    
    print("\nLast transaction that was not automatic was " +str(IDinfo["Payment Characterization"][last])+ 
          "(" +str(IDinfo["Transaction Mode"][last]) + ")"" and occured in " +
          str(IDinfo.Day[last])+"/"+str(IDinfo.Month[last])+"/"+str(IDinfo.Year[last] ))
    
    
    #Printing information about the loans (their number, id, status, date of last payment if it has been fully payed,
    #amount left to pay, montly payment, time left before fully paid if everythin goes right.)
    if nbofloan == 0:
        print("\nThis client never took any loan from us.")
    
    else:
        print("\nThis client was issued " + str(nbofloan) + " loan(s). \nLoan status is/are :\n")
        
        for n in range(nbofloan):
            print("*Loan " +str(loantest["loan_id"].iloc[n]) + " issued the " + 
                  str(loantest.Day.iloc[n-1])+"/"+str(loantest.Month.iloc[n-1])+"/"+str(loantest.Year.iloc[n-1]) +
                  " for an amount of " + str(loantest.amount.iloc[n-1]) +
                  " and its status is " + str(loantest.status.iloc[n-1])+".")
            
            if loantest.status.iloc[n-1] =='A':
                loansituation(n)
                print("\n\tThe loan has been fully paid.")
            
            elif loantest.status.iloc[n] =='D':
                print("\n\tClient is late in the payment of the loan, the client is in debt !")
                loansituation(n)
                print("\n\tAmount already paid : " + str(paid) + 
                      "\n\tAmount left to pay : " + str(lefttopay) +
                      "\n\tNumber of payment made : " + str(nbrpayment))
                print("\n\t")
            
            elif loantest.status.iloc[n] =='B':
                print("\n\tThe contract is finished but the loan is not fully paid yet !")
                loansituation(n)
                print("\n\tAmount already paid : " + str(paid) + 
                      "\n\tAmount left to pay : " + str(lefttopay) +
                      "\n\tNumber of payment made : " + str(nbrpayment)) 
                
                IdinfoLoan = IDinfo[IDinfo["Payment Characterization"]=="LOAN"]
                loantest.payments[n]==IDinfoLoan[IDinfoLoan["amount"]]
                
            elif loantest.status.iloc[n] =='C':
                print("\n\tThe contract is still going and the loan is not fully paid yet. Situation is normal.")
                loansituation(n)
                print("\n\tAmount already paid : " + str(paid) + 
                      "\n\tAmount left to pay : " + str(lefttopay) +
                      "\n\tNumber of payment made : " + str(nbrpayment)) 
                
            else:
                print("\n\tThe status of this loan seems to been unknown or incorrectly specified in our files." +
                     "\n\tAsk IT for support on this problem.")
                
    print("\n" + "-"*20)
    #return IDinfo.tail()

TableInformation definition:

In [63]:
def TableInformation():
    global whateveritis
    try:

        #Prompting the user to enter an ID
        ID = int(input("Which client line would you like to display ?" +
                           "\n\tPlease type the ID(s) here : "))

    except ValueError:
        print("\nDid you correctly entered your ID(s) ? It should not contains any character or float numbers.")
        return None
    except TypeError:
        print("\nDid you correctly entered your ID(s) ? It should not contains any character or float numbers.")
        return None
    return Table3[Table3["client_id"]==ID]

In [32]:
#To create a field to merge on 
card['account_id'] = card['disp_id']
card.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 892 entries, 0 to 891
Data columns (total 8 columns):
card_id       892 non-null int64
disp_id       892 non-null int64
type          892 non-null object
issued        892 non-null object
Year          892 non-null object
Month         892 non-null object
Day           892 non-null object
account_id    892 non-null int64
dtypes: int64(3), object(5)
memory usage: 55.8+ KB

In [33]:
#To merge card and trans: created to see which card carried out which transaction.
card_transaction = pd.merge(card, trans, how = 'left', on = 'account_id')
card_transaction.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 141244 entries, 0 to 141243
Data columns (total 23 columns):
card_id                     141244 non-null int64
disp_id                     141244 non-null int64
type_x                      141244 non-null object
issued                      141244 non-null object
Year_x                      141244 non-null object
Month_x                     141244 non-null object
Day_x                       141244 non-null object
account_id                  141244 non-null int64
trans_id                    140967 non-null float64
date                        140967 non-null float64
type_y                      140967 non-null object
operation                   116526 non-null object
amount                      140967 non-null float64
balance                     140967 non-null float64
k_symbol                    78140 non-null object
bank                        37673 non-null object
account                     39819 non-null float64
Year_y                      140967 non-null object
Month_y                     140967 non-null object
Day_y                       140967 non-null object
Payment Characterization    140967 non-null object
Transaction Type            140967 non-null object
Transaction Mode            140967 non-null object
dtypes: float64(5), int64(3), object(15)
memory usage: 25.9+ MB

In [34]:
#To change name
client["district_code"] = client["district_id"]
client.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5369 entries, 0 to 5368
Data columns (total 9 columns):
client_id        5369 non-null int64
birth_number     5369 non-null int64
district_id      5369 non-null int64
birth_year       5369 non-null int64
age              5369 non-null int64
birth_month      5369 non-null int64
birth_day        5369 non-null int64
gender           5369 non-null object
district_code    5369 non-null int64
dtypes: int64(8), object(1)
memory usage: 377.6+ KB

In [35]:
#start of basetable1
client_district = pd.merge(client, district, on = 'district_code', how = 'left')
#To set index
client_district.set_index('district_id')
client_district.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5369 entries, 0 to 5368
Data columns (total 24 columns):
client_id             5369 non-null int64
birth_number          5369 non-null int64
district_id           5369 non-null int64
birth_year            5369 non-null int64
age                   5369 non-null int64
birth_month           5369 non-null int64
birth_day             5369 non-null int64
gender                5369 non-null object
district_code         5369 non-null int64
district_name         5369 non-null object
region                5369 non-null object
Number_inhabitants    5369 non-null int64
A5                    5369 non-null int64
A6                    5369 non-null int64
A7                    5369 non-null int64
A8                    5369 non-null int64
A9                    5369 non-null int64
%_urbans              5369 non-null float64
Avrg_Salary           5369 non-null int64
A12                   5369 non-null object
A13                   5369 non-null float64
A14                   5369 non-null int64
A15                   5369 non-null object
A16                   5369 non-null int64
dtypes: float64(2), int64(17), object(5)
memory usage: 1.0+ MB

In [36]:
#drop added filed for merge
client_district = client_district.drop(['district_code'], axis = 1)
#drop unwanted columns
client_district = client_district.drop(columns = ['A5','A6','A7','A8','A9','A12','A13','A14','A15','A16'])

client_district.head()

,client_id,birth_number,district_id,birth_year,age,birth_month,birth_day,gender,district_name,region,Number_inhabitants,%_urbans,Avrg_Salary
0,1,706213,18,1970,29,12,13,F,Pisek,south Bohemia,70699,65.3,8968
1,2,450204,1,1945,54,2,4,M,Hl.m. Praha,Prague,1204953,100.0,12541
2,3,406009,1,1940,59,10,9,F,Hl.m. Praha,Prague,1204953,100.0,12541
3,4,561201,5,1956,43,12,1,M,Kolin,central Bohemia,95616,51.4,9307
4,5,605703,5,1960,39,7,3,F,Kolin,central Bohemia,95616,51.4,9307

In [37]:
# Use so that each observation is a client #
client_district.set_index('client_id')

,birth_number,district_id,birth_year,age,birth_month,birth_day,gender,district_name,region,Number_inhabitants,%_urbans,Avrg_Salary
client_id,,,,,,,,,,,,
1,706213,18,1970,29,12,13,F,Pisek,south Bohemia,70699,65.3,8968
2,450204,1,1945,54,2,4,M,Hl.m. Praha,Prague,1204953,100.0,12541
3,406009,1,1940,59,10,9,F,Hl.m. Praha,Prague,1204953,100.0,12541
4,561201,5,1956,43,12,1,M,Kolin,central Bohemia,95616,51.4,9307
5,605703,5,1960,39,7,3,F,Kolin,central Bohemia,95616,51.4,9307
6,190922,12,1919,80,9,22,M,Pribram,central Bohemia,107870,58.0,8754
7,290125,15,1929,70,1,25,M,Cesky Krumlov,south Bohemia,58796,51.9,9045
8,385221,51,1938,61,2,21,F,Trutnov,east Bohemia,121947,70.5,8541
9,351016,60,1935,64,10,16,M,Prostejov,south Moravia,110643,51.9,8441
10,430501,57,1943,56,5,1,M,Hodonin,south Moravia,161954,48.0,8720
11,505822,57,1950,49,8,22,F,Hodonin,south Moravia,161954,48.0,8720
12,810220,40,1981,18,2,20,M,Teplice,north Bohemia,128118,85.3,9317
13,745529,54,1974,25,5,29,F,Brno - mesto,south Moravia,387570,100.0,9897
14,425622,76,1942,57,6,22,F,Sumperk,north Moravia,127369,51.2,8369
15,185828,21,1918,81,8,28,F,Tabor,south Bohemia,103347,67.0,9104
16,190225,21,1919,80,2,25,M,Tabor,south Bohemia,103347,67.0,9104
17,341013,76,1934,65,10,13,M,Sumperk,north Moravia,127369,51.2,8369
18,315405,76,1931,68,4,5,F,Sumperk,north Moravia,127369,51.2,8369
19,421228,47,1942,57,12,28,M,Pardubice,east Bohemia,162580,72.8,9538
20,790104,46,1979,20,1,4,M,Nachod,east Bohemia,112709,73.5,8369
21,526029,12,1952,47,10,29,F,Pribram,central Bohemia,107870,58.0,8754
22,696011,1,1969,30,10,11,F,Hl.m. Praha,Prague,1204953,100.0,12541
23,730529,1,1973,26,5,29,M,Hl.m. Praha,Prague,1204953,100.0,12541
24,395729,43,1939,60,7,29,F,Hradec Kralove,east Bohemia,161854,76.3,9425
25,395423,21,1939,60,4,23,F,Tabor,south Bohemia,103347,67.0,9104
26,695420,74,1969,30,4,20,F,Ostrava - mesto,north Moravia,323870,100.0,10673
27,665326,54,1966,33,3,26,F,Brno - mesto,south Moravia,387570,100.0,9897
28,450929,1,1945,54,9,29,M,Hl.m. Praha,Prague,1204953,100.0,12541
29,515911,30,1951,48,9,11,F,Sokolov,west Bohemia,94812,81.8,9650
30,576009,74,1957,42,10,9,F,Ostrava - mesto,north Moravia,323870,100.0,10673
...,...,...,...,...,...,...,...,...,...,...,...,...
13588,740129,46,1974,25,1,29,M,Nachod,east Bohemia,112709,73.5,8369
13590,770803,59,1977,22,8,3,M,Kromeriz,south Moravia,108871,62.1,8444
13603,410728,46,1941,58,7,28,M,Nachod,east Bohemia,112709,73.5,8369
13608,635515,37,1963,36,5,15,F,Litomerice,north Bohemia,114006,62.3,9065
13620,700726,16,1970,29,7,26,M,Jindrichuv Hradec,south Bohemia,93931,56.9,8427
13640,555609,28,1955,44,6,9,F,Plzen - sever,west Bohemia,72541,36.9,8594
13657,635512,59,1963,36,5,12,F,Kromeriz,south Moravia,108871,62.1,8444
13658,570423,59,1957,42,4,23,M,Kromeriz,south Moravia,108871,62.1,8444
13673,710220,39,1971,28,2,20,M,Most,north Bohemia,119895,89.9,10446
13687,590523,75,1959,40,5,23,M,Prerov,north Moravia,138032,64.6,8819
13690,630516,70,1963,36,5,16,M,Karvina,north Moravia,285387,89.9,10177
13694,765120,1,1976,23,1,20,F,Hl.m. Praha,Prague,1204953,100.0,12541
13750,806113,12,1980,19,11,13,F,Pribram,central Bohemia,107870,58.0,8754
13751,790720,12,1979,20,7,20,M,Pribram,central Bohemia,107870,58.0,8754
13803,471114,1,1947,52,11,14,M,Hl.m. Praha,Prague,1204953,100.0,12541
13820,485731,33,1948,51,7,31,F,Decin,north Bohemia,133777,84.7,8705
13845,730216,15,1973,26,2,16,M,Cesky Krumlov,south Bohemia,58796,51.9,9045
13852,720126,5,1972,27,1,26,M,Kolin,central Bohemia,95616,51.4,9307
13886,545412,44,1954,45,4,12,F,Chrudim,east Bohemia,105606,53.0,8254
13912,751120,50,1975,24,11,20,M,Svitavy,east Bohemia,102609,52.0,8187
13915,741123,77,1974,25,11,23,M,Vsetin,north Moravia,148545,53.5,8909
13921,706220,62,1970,29,12,20,F,Uherske Hradiste,south Moravia,145688,40.7,8544
13923,795222,7,1979,20,2,22,F,Melnik,central Bohemia,94725,63.4,9920
13924,525909,54,1952,47,9,9,F,Brno - mesto,south Moravia,387570,100.0,9897
13931,420101,8,1942,57,1,1,M,Mlada Boleslav,central Bohemia,112065,69.4,11277
13955,456030,1,1945,54,10,30,F,Hl.m. Praha,Prague,1204953,100.0,12541
13956,430406,1,1943,56,4,6,M,Hl.m. Praha,Prague,1204953,100.0,12541
13968,680413,61,1968,31,4,13,M,Trebic,south Moravia,117897,53.8,8814
13971,626019,67,1962,37,10,19,F,Bruntal,north Moravia,106054,63.1,8110
13998,535812,74,1953,46,8,12,F,Ostrava - mesto,north Moravia,323870,100.0,10673

In [38]:
#change name#
basetable1 = client_district

In [39]:
#check for nulls#
basetable1.isna().sum().sum()

0

In [40]:
#Setting Client ID as Index##
basetable1.set_index('client_id')
basetable1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5369 entries, 0 to 5368
Data columns (total 13 columns):
client_id             5369 non-null int64
birth_number          5369 non-null int64
district_id           5369 non-null int64
birth_year            5369 non-null int64
age                   5369 non-null int64
birth_month           5369 non-null int64
birth_day             5369 non-null int64
gender                5369 non-null object
district_name         5369 non-null object
region                5369 non-null object
Number_inhabitants    5369 non-null int64
%_urbans              5369 non-null float64
Avrg_Salary           5369 non-null int64
dtypes: float64(1), int64(9), object(3)
memory usage: 587.2+ KB

In [41]:
##Function to check if an account has a disponent##
def disponent (i):
        if i == "DISPONENT":
            return "Y"
        else:
            return "N"

In [42]:
Table1 = pd.merge(basetable1,disp, how = 'left', on = 'client_id')

Table2 = pd.merge(Table1,account, how = 'left', on = 'account_id')

Table3 = pd.merge(Table2,loan, how = 'left', on = 'account_id')

In [43]:
Table3["Disponent"] = Table3["type"].apply(disponent)
Table3.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5369 entries, 0 to 5368
Data columns (total 33 columns):
client_id             5369 non-null int64
birth_number          5369 non-null int64
district_id_x         5369 non-null int64
birth_year            5369 non-null int64
age                   5369 non-null int64
birth_month           5369 non-null int64
birth_day             5369 non-null int64
gender                5369 non-null object
district_name         5369 non-null object
region                5369 non-null object
Number_inhabitants    5369 non-null int64
%_urbans              5369 non-null float64
Avrg_Salary           5369 non-null int64
disp_id               5369 non-null int64
account_id            5369 non-null int64
type                  5369 non-null object
district_id_y         5369 non-null int64
frequency             5369 non-null object
date_x                5369 non-null int64
freq                  5369 non-null object
Year_x                5369 non-null object
Month_x               5369 non-null object
Day_x                 5369 non-null object
loan_id               827 non-null float64
date_y                827 non-null float64
amount                827 non-null float64
duration              827 non-null float64
payments              827 non-null float64
status                827 non-null object
Year_y                827 non-null object
Month_y               827 non-null object
Day_y                 827 non-null object
Disponent             5369 non-null object
dtypes: float64(6), int64(13), object(14)
memory usage: 1.4+ MB

In [44]:
trans.head()

,trans_id,account_id,date,type,operation,amount,balance,k_symbol,bank,account,Year,Month,Day,Payment Characterization,Transaction Type,Transaction Mode
0,695247,2378,930101,PRIJEM,VKLAD,700.0,700.0,NaN,NaN,NaN,1993,01,01,UNKNOWN,+,Credit in cash
1,171812,576,930101,PRIJEM,VKLAD,900.0,900.0,NaN,NaN,NaN,1993,01,01,UNKNOWN,+,Credit in cash
2,207264,704,930101,PRIJEM,VKLAD,1000.0,1000.0,NaN,NaN,NaN,1993,01,01,UNKNOWN,+,Credit in cash
3,1117247,3818,930101,PRIJEM,VKLAD,600.0,600.0,NaN,NaN,NaN,1993,01,01,UNKNOWN,+,Credit in cash
4,579373,1972,930102,PRIJEM,VKLAD,400.0,400.0,NaN,NaN,NaN,1993,01,02,UNKNOWN,+,Credit in cash

In [45]:
order.head()

,order_id,account_id,bank_to,account_to,amount,k_symbol,Payment characterization
0,29401,1,YZ,87144583,2452.0,SIPO,HOUSEHOLD
1,29402,2,ST,89597016,3372.7,UVER,LOAN
2,29403,2,QR,13943797,7266.0,SIPO,HOUSEHOLD
3,29404,3,WX,83084338,1135.0,SIPO,HOUSEHOLD
4,29405,3,CD,24485939,327.0,,UNKNOWN

In [46]:
###checking unquies##
order['bank_to'].nunique()

13

In [47]:
##create a variable name to read into ##
orders_copy = order

In [48]:
#creating variables with SQL and pandas##

order_a = pysqldf("""
SELECT account_id,
sum(amount) as order_amount, 
count(amount) as number_of_orders
FROM orders_copy
GROUP BY account_id
""")

In [49]:
order_a.head()

   account_id  order_amount  number_of_orders
0           1        2452.0                 1
1           2       10638.7                 2
2           3        5001.0                 3
3           4        3363.0                 2
4           5        2668.0                 1

In [50]:
##create a variable name to read into ##
trans_a = trans

In [51]:
#creating variables with SQL and pandas##

trans_a =  pysqldf("""
SELECT account_id, operation,
sum(amount) as amount,
count(amount) as number_of_transaction,
Max(amount) as Max_transaction,
Min(amount) as Min_transaction,
avg(amount) as AVG_transaction,
            CASE 
                WHEN operation = 'VYBER KARTOU' THEN 'Credit Card Withdrawl'
                WHEN operation = 'VKLAD' THEN ' Credit in cash '
                WHEN operation = 'PREVOD Z UCTU' THEN 'Collection from another bank'
                WHEN operation = 'VYBER' THEN 'Withdrawl in cash'
                WHEN operation = 'PREVOD NA UCET' THEN 'Remittance to another banl'
                ELSE 'Other transaction'
            END AS TransactionMode,
            CASE 
                WHEN k_symbol = 'POJISTNE' THEN 'Insurance Payment'
                WHEN k_symbol = 'SLUZBY' THEN 'Payment for statement'
                WHEN k_symbol = 'UROK' THEN 'Intrest credited'
                WHEN k_symbol = 'SANKC. UROK' THEN 'Sanction interest if negative balance'
                WHEN k_symbol = 'SIPO' THEN 'Stands for household'
                WHEN k_symbol = 'DUCHOD' THEN 'Stands for old-age pension'
                WHEN k_symbol = '"UVER' THEN 'Stands for loan payment'
                ELSE 'Other'
            END AS TransactionCharacterization,
            SUM(CASE 
                    WHEN type = "PRIJEM" THEN 1 ELSE 0 END) as 'UsedForCredit',
            SUM(CASE 
                    WHEN type = "VYDAJ" THEN 1 ELSE 0 END) as 'Withdrawl'
FROM trans_a
GROUP BY account_id

""")

In [52]:
trans_a.head()

,account_id,operation,amount,number_of_transaction,Max_transaction,Min_transaction,AVG_transaction,TransactionMode,TransactionCharacterization,UsedForCredit,Withdrawl
0,1,VYBER,375174.5,239,12600.0,14.6,1569.767782,Withdrawl in cash,Payment for statement,102,137
1,2,None,3151479.3,478,42000.0,13.5,6593.052929,Other transaction,Intrest credited,152,305
2,3,VYBER,295021.8,117,11253.0,14.6,2521.553846,Withdrawl in cash,Payment for statement,46,71
3,4,VYBER,350971.4,186,5553.0,14.6,1886.943011,Withdrawl in cash,Payment for statement,65,121
4,5,None,166881.4,84,5100.0,3.5,1986.683333,Other transaction,Intrest credited,35,49

In [53]:
##create a variable name to read into ##
card_a = card

In [54]:
#SQL query created based on card table, however we did not include this, as didnt bring added value to the final datamart##
card_a = pysqldf("""
SELECT account_id, 
count(type) as number_of_cardtrypes
FROM card_a
GROUP BY account_id
""")

In [55]:
#Merge the tables together to creae the final table : Table3

Table3 = pd.merge(Table3,order_a, how = 'left', on = 'account_id')
Table3 = pd.merge(Table3,trans_a, how = 'left', on = 'account_id')

In [56]:
Table3.head()

,client_id,birth_number,district_id_x,birth_year,age,birth_month,birth_day,gender,district_name,region,...,operation,amount_y,number_of_transaction,Max_transaction,Min_transaction,AVG_transaction,TransactionMode,TransactionCharacterization,UsedForCredit,Withdrawl
0,1,706213,18,1970,29,12,13,F,Pisek,south Bohemia,...,VYBER,375174.5,239,12600.0,14.6,1569.767782,Withdrawl in cash,Payment for statement,102,137
1,2,450204,1,1945,54,2,4,M,Hl.m. Praha,Prague,...,None,3151479.3,478,42000.0,13.5,6593.052929,Other transaction,Intrest credited,152,305
2,3,406009,1,1940,59,10,9,F,Hl.m. Praha,Prague,...,None,3151479.3,478,42000.0,13.5,6593.052929,Other transaction,Intrest credited,152,305
3,4,561201,5,1956,43,12,1,M,Kolin,central Bohemia,...,VYBER,295021.8,117,11253.0,14.6,2521.553846,Withdrawl in cash,Payment for statement,46,71
4,5,605703,5,1960,39,7,3,F,Kolin,central Bohemia,...,VYBER,295021.8,117,11253.0,14.6,2521.553846,Withdrawl in cash,Payment for statement,46,71

In [57]:
#To Clean the datamart a bit more, by removing any duplicate columns and any columns which may not be useful to the bank manager#

Table3["district_ID"] = Table3["district_id_x"]
Table3["Year"] = Table3["Year_x"]
Table3["Month"] = Table3["Month_x"]
Table3["Day"] = Table3["Day_x"]
Table3["amount"] = Table3["amount_x"]

Table3 = Table3.drop(columns = ["%_urbans","district_id_y","Year_y","Month_y","amount_y"])
Table3 = Table3.drop(columns = ["Day_y"])
Table3 = Table3.drop(columns = ["freq","frequency","date_y"])
Table3 = Table3.drop(columns = ["district_id_x","Year_x","Month_x","Day_x","amount_x"])
Table3 = Table3.drop(columns = ["date_x"])

In [58]:
Table3.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5369 entries, 0 to 5368
Data columns (total 35 columns):
client_id                      5369 non-null int64
birth_number                   5369 non-null int64
birth_year                     5369 non-null int64
age                            5369 non-null int64
birth_month                    5369 non-null int64
birth_day                      5369 non-null int64
gender                         5369 non-null object
district_name                  5369 non-null object
region                         5369 non-null object
Number_inhabitants             5369 non-null int64
Avrg_Salary                    5369 non-null int64
disp_id                        5369 non-null int64
account_id                     5369 non-null int64
type                           5369 non-null object
loan_id                        827 non-null float64
duration                       827 non-null float64
payments                       827 non-null float64
status                         827 non-null object
Disponent                      5369 non-null object
order_amount                   4560 non-null float64
number_of_orders               4560 non-null float64
operation                      4221 non-null object
number_of_transaction          5369 non-null int64
Max_transaction                5369 non-null float64
Min_transaction                5369 non-null float64
AVG_transaction                5369 non-null float64
TransactionMode                5369 non-null object
TransactionCharacterization    5369 non-null object
UsedForCredit                  5369 non-null int64
Withdrawl                      5369 non-null int64
district_ID                    5369 non-null int64
Year                           5369 non-null object
Month                          5369 non-null object
Day                            5369 non-null object
amount                         827 non-null float64
dtypes: float64(9), int64(14), object(12)
memory usage: 1.5+ MB

In [59]:
 WithdrawlsAVG = pysqldf("""
 SELECT district_name, Withdrawl
 FROM Table3
 WHERE withdrawl > 450
 """)

### Interactive functions

In [ ]:
TableInformation()

In [ ]:
TextInformation()

In [ ]:
Table3.pd.DataFrame.to_csv()